import { Client } from "./After/flyweight_client";
import { BeforeClient } from "./Before/client";

BeforeClient.main();
// x: 9065.842342887978 y: 1011.329899917146 위치에 Oak 나무 생성 완료
// x: 8101.131607060823 y: 9409.354744995466 위치에 Oak 나무 생성 완료
// x: 2909.0642351863316 y: 5593.374329290226 위치에 Oak 나무 생성 완료
// x: 5136.914306245595 y: 8590.446610944817 위치에 Oak 나무 생성 완료
// x: 1446.0649837157314 y: 6773.494291516853 위치에 Oak 나무 생성 완료
// x: 3996.7435437060694 y: 9070.085525047807 위치에 Acacia 나무 생성 완료
// x: 2712.602719730484 y: 1137.2995014402077 위치에 Acacia 나무 생성 완료
// x: 6376.661986630401 y: 775.431018204844 위치에 Acacia 나무 생성 완료
// x: 448.1128594488748 y: 6313.660880020049 위치에 Acacia 나무 생성 완료
// x: 822.36553395999 y: 2446.62997492618 위치에 Acacia 나무 생성 완료
// x: 4558.192739569893 y: 9917.41916921661 위치에 Jungle 나무 생성 완료
// x: 7799.029421897061 y: 9330.383081252816 위치에 Jungle 나무 생성 완료
// x: 162.0281320785688 y: 754.9106790861138 위치에 Jungle 나무 생성 완료
// x: 1687.588688498214 y: 481.9343540922283 위치에 Jungle 나무 생성 완료
// x: 7240.916066255259 y: 4798.594031274077 위치에 Jungle 나무 생성 완료
// 총 메모리 사용량 : 1500MB

Client.main();
// === 나무 모델 객체 새로 생성 완료 ===
// x: 2633.3314223971115 y: 5099.839844034362 위치에 Oak 나무 생성 완료
// x: 4361.821032621547 y: 2472.6162218406243 위치에 Oak 나무 생성 완료
// x: 4418.517525885705 y: 9951.134219621934 위치에 Oak 나무 생성 완료
// x: 984.1592171048563 y: 8019.1816891050685 위치에 Oak 나무 생성 완료
// x: 6219.430320425791 y: 7212.363383149667 위치에 Oak 나무 생성 완료
// === 나무 모델 객체 새로 생성 완료 ===
// x: 4216.846583418333 y: 2388.2578986138815 위치에 Acacia 나무 생성 완료
// x: 3469.201392140364 y: 2607.66882066956 위치에 Acacia 나무 생성 완료
// x: 2946.273467439644 y: 4104.665968215991 위치에 Acacia 나무 생성 완료
// x: 8553.383315730136 y: 2034.5062388182077 위치에 Acacia 나무 생성 완료
// x: 6347.725747075905 y: 4502.577659759426 위치에 Acacia 나무 생성 완료
// === 나무 모델 객체 새로 생성 완료 ===
// x: 8736.873932320015 y: 2818.899027849138 위치에 Jungle 나무 생성 완료
// x: 4421.734692043186 y: 4172.795209040046 위치에 Jungle 나무 생성 완료
// x: 9228.914937157484 y: 5751.144986911503 위치에 Jungle 나무 생성 완료
// x: 2142.283067509878 y: 1323.7637470256857 위치에 Jungle 나무 생성 완료
// x: 2910.2317882044335 y: 4874.301066940363 위치에 Jungle 나무 생성 완료
// 총 메모리 사용량 : 420MB
